#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-cost-slack.module.serverless.aws_cloudformation_stack.outputs_lambda_role[0] will be created
  + resource "aws_cloudformation_stack" "outputs_lambda_role" {
      + id            = (known after apply)
      + name          = "tf-aws-cost-slack-development-outputs-lambda-role"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags          = {
          + "Service" = "aws-cost-slack"
          + "Stage"   = "development"
        }
      + template_body = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group.admin[0] will be created
  + resource "aws_iam_group" "admin" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-aws-cost-slack-development-admin"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group.ci[0] will be created
  + resource "aws_iam_group" "ci" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-aws-cost-slack-development-ci"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group.developer[0] will be created
  + resource "aws_iam_group" "developer" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tf-aws-cost-slack-development-developer"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_admin[0] will be created
  + resource "aws_iam_group_policy_attachment" "admin_admin" {
      + group      = "tf-aws-cost-slack-development-admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_cd_lambdas[0] will be created
  + resource "aws_iam_group_policy_attachment" "admin_cd_lambdas" {
      + group      = "tf-aws-cost-slack-development-admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_developer[0] will be created
  + resource "aws_iam_group_policy_attachment" "admin_developer" {
      + group      = "tf-aws-cost-slack-development-admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.ci_developer[0] will be created
  + resource "aws_iam_group_policy_attachment" "ci_developer" {
      + group      = "tf-aws-cost-slack-development-ci"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.developer_developer[0] will be created
  + resource "aws_iam_group_policy_attachment" "developer_developer" {
      + group      = "tf-aws-cost-slack-development-developer"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.admin will be created
  + resource "aws_iam_policy" "admin" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "tf-aws-cost-slack-development-admin"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudformation:PreviewStackUpdate",
                          + "cloudformation:ListStacks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:DeleteStack",
                          + "cloudformation:CreateUploadBucket",
                          + "cloudformation:CreateStack",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-development/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutEncryptionConfiguration",
                          + "s3:PutBucketPolicy",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:DeleteBucketPolicy",
                          + "s3:DeleteBucket",
                          + "s3:CreateBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:s3:::sls-aws-cost-slack-*-serverless*-*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "events:Remove*",
                          + "events:Put*",
                          + "events:Delete*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:events:*:589845989135:rule/sls-aws-cost-slack-development"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "cloudwatch:GetMetricStatistics"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.cd_lambdas will be created
  + resource "aws_iam_policy" "cd_lambdas" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "tf-aws-cost-slack-development-cd-lambdas"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:UntagResource",
                          + "lambda:TagResource",
                          + "lambda:ListTags",
                          + "lambda:ListFunctions",
                          + "lambda:ListEventSourceMappings",
                          + "lambda:GetEventSourceMapping",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "lambda:DeleteFunction",
                          + "lambda:CreateFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-development-*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "logs:DescribeLogGroups"
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:589845989135:log-group::log-stream:"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DeleteLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.developer will be created
  + resource "aws_iam_policy" "developer" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "tf-aws-cost-slack-development-developer"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "cloudformation:ValidateTemplate"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:UpdateStack",
                          + "cloudformation:ListStackResources",
                          + "cloudformation:ListChangeSets",
                          + "cloudformation:Get*",
                          + "cloudformation:DescribeStacks",
                          + "cloudformation:DescribeStackResources",
                          + "cloudformation:DescribeStackResource",
                          + "cloudformation:DescribeStackEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-development/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:s3:::sls-aws-cost-slack-*-serverless*-*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "iam:PassRole",
                          + "iam:GetRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "lambda:Update*",
                          + "lambda:RemovePermission",
                          + "lambda:PublishVersion",
                          + "lambda:ListVersionsByFunction",
                          + "lambda:ListAliases",
                          + "lambda:InvokeFunction",
                          + "lambda:GetPolicy",
                          + "lambda:GetFunctionConfiguration",
                          + "lambda:GetFunction",
                          + "lambda:GetAlias",
                          + "lambda:CreateAlias",
                          + "lambda:AddPermission",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-development-*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "lambda:PublishLayerVersion",
                          + "lambda:GetLayerVersion",
                          + "lambda:DeleteLayerVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:589845989135:layer:sls-aws-cost-slack-development-*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "apigateway:UpdateRestApiPolicy",
                          + "apigateway:PUT",
                          + "apigateway:POST",
                          + "apigateway:PATCH",
                          + "apigateway:GET",
                          + "apigateway:DELETE",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/tags*",
                          + "arn:*:apigateway:*::/restapis*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:*",
                          + "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.lambda will be created
  + resource "aws_iam_policy" "lambda" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "tf-aws-cost-slack-development-lambda-execution"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogStream"
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development*:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "logs:PutLogEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-aws-cost-slack-development-lambda-execution"
      + path                  = "/"
      + tags                  = {
          + "Service" = "aws-cost-slack"
          + "Stage"   = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_role_policy_attachment.lambda will be created
  + resource "aws_iam_role_policy_attachment" "lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-aws-cost-slack-development-lambda-execution"
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
